Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 1500, 1500, 100)   0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1500, 1500, 8)     7208      
_________________________________________________________________
batch_normalization_3 (Batch (None, 1500, 1500, 8)     32        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 1500, 1500, 8)     0         
=================================================================
Total params: 7,240
Trainable params: 7,224
Non-trainable params: 16
_________________________________________________________________
