Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 150, 150, 100)     0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 150, 150, 8)       7208      
_________________________________________________________________
batch_normalization_2 (Batch (None, 150, 150, 8)       32        
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 150, 150, 8)       0         
=================================================================
Total params: 7,240
Trainable params: 7,224
Non-trainable params: 16
_________________________________________________________________
