Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 150, 150, 100)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 150, 150, 8)       7208      
_________________________________________________________________
batch_normalization_1 (Batch (None, 150, 150, 8)       32        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 150, 150, 8)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 75, 75, 8)         0         
=================================================================
Total params: 7,240
Trainable params: 7,224
Non-trainable params: 16
_________________________________________________________________
