Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 16, 16, 32)        2432      
_________________________________________________________________
batch_normalization_22 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 8, 8, 64)          18496     
_________________________________________________________________
batch_normalization_23 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_24 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 4, 4, 128)         73856     
_________________________________________________________________
batch_normalization_25 (Batc (None, 4, 4, 128)         512       
_________________________________________________________________
leaky_re_lu_25 (LeakyReLU)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
batch_normalization_26 (Batc (None, 4, 4, 128)         512       
_________________________________________________________________
leaky_re_lu_26 (LeakyReLU)   (None, 4, 4, 128)         0         
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 2, 2, 128)         0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 2, 2, 256)         295168    
_________________________________________________________________
batch_normalization_27 (Batc (None, 2, 2, 256)         1024      
_________________________________________________________________
leaky_re_lu_27 (LeakyReLU)   (None, 2, 2, 256)         0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 2, 2, 256)         590080    
_________________________________________________________________
batch_normalization_28 (Batc (None, 2, 2, 256)         1024      
_________________________________________________________________
leaky_re_lu_28 (LeakyReLU)   (None, 2, 2, 256)         0         
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 1, 1, 256)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 2056      
=================================================================
Total params: 1,170,312
Trainable params: 1,168,456
Non-trainable params: 1,856
_________________________________________________________________
