Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
separable_conv2d_2 (Separabl (None, 16, 16, 16)        91        
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 16)          0         
=================================================================
Total params: 91
Trainable params: 91
Non-trainable params: 0
_________________________________________________________________
