Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 16, 16)        1216      
_________________________________________________________________
batch_normalization_10 (Batc (None, 16, 16, 16)        64        
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 16, 16, 16)        0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
batch_normalization_12 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 8, 8, 32)          0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 4, 4, 32)          0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 4104      
=================================================================
Total params: 19,528
Trainable params: 19,368
Non-trainable params: 160
_________________________________________________________________
