Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 16, 16, 128)       9728      
_________________________________________________________________
batch_normalization_19 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 16, 16, 128)       0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_20 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_re_lu_20 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 8, 8, 256)         590080    
_________________________________________________________________
batch_normalization_21 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 4, 4, 256)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 8)                 32776     
=================================================================
Total params: 930,312
Trainable params: 929,032
Non-trainable params: 1,280
_________________________________________________________________
