Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 128, 3)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 128, 16)           160       
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 64, 16)            0         
=================================================================
Total params: 160
Trainable params: 160
Non-trainable params: 0
_________________________________________________________________
