Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 16, 32)        2432      
_________________________________________________________________
batch_normalization_13 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 16, 16, 32)        0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 8, 8, 32)          0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 8, 8, 64)          18496     
_________________________________________________________________
batch_normalization_14 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 8, 8, 64)          36928     
_________________________________________________________________
batch_normalization_15 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
leaky_re_lu_15 (LeakyReLU)   (None, 8, 8, 64)          0         
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 4, 4, 64)          0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_5 (Dense)              (None, 8)                 8200      
=================================================================
Total params: 66,696
Trainable params: 66,376
Non-trainable params: 320
_________________________________________________________________
