Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 128, 3)            0         
_________________________________________________________________
separable_conv1d_2 (Separabl (None, 128, 16)           73        
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 64, 16)            0         
=================================================================
Total params: 73
Trainable params: 73
Non-trainable params: 0
_________________________________________________________________
