Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 8)         608       
_________________________________________________________________
batch_normalization_7 (Batch (None, 16, 16, 8)         32        
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 16, 16, 8)         0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 8, 8, 8)           0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 16)          1168      
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 16)          64        
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 16)          2320      
_________________________________________________________________
batch_normalization_9 (Batch (None, 8, 8, 16)          64        
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 8, 8, 16)          0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 4, 4, 16)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 2056      
=================================================================
Total params: 6,312
Trainable params: 6,232
Non-trainable params: 80
_________________________________________________________________
