Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 4)         304       
_________________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 4)         16        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 16, 16, 4)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 4)           0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 8)           296       
_________________________________________________________________
batch_normalization_5 (Batch (None, 8, 8, 8)           32        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 8, 8, 8)           0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 8)           584       
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 8)           32        
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 8, 8, 8)           0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 4, 8)           0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 1032      
=================================================================
Total params: 2,296
Trainable params: 2,256
Non-trainable params: 40
_________________________________________________________________
