Model: "model_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 16, 16, 256)       19456     
_________________________________________________________________
batch_normalization_22 (Batc (None, 16, 16, 256)       1024      
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 16, 16, 256)       0         
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 8, 8, 512)         1180160   
_________________________________________________________________
batch_normalization_23 (Batc (None, 8, 8, 512)         2048      
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 8, 8, 512)         0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 8, 8, 512)         2359808   
_________________________________________________________________
batch_normalization_24 (Batc (None, 8, 8, 512)         2048      
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (None, 8, 8, 512)         0         
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 4, 4, 512)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 8)                 65544     
=================================================================
Total params: 3,630,088
Trainable params: 3,627,528
Non-trainable params: 2,560
_________________________________________________________________
